#+TITLE: RSA key generation with OpenSSL
#+PROPERTY: header-args:sh :session *shell rsa-key-generation sh* :results silent raw

** Generate private key

#+BEGIN_SRC sh
openssl genrsa -out ./keys/private.pem 2048
#+END_SRC


** Export public key

#+BEGIN_SRC sh
openssl rsa -in ./keys/private.pem -outform PEM -pubout -out ./keys/public.pem
#+END_SRC


** View private key

#+BEGIN_SRC sh
openssl rsa -in ./keys/private.pem -text -noout
#+END_SRC

#+RESULTS:
#+begin_example
Private-Key: (2048 bit)
modulus:
    00:a8:22:e2:13:d9:8a:18:04:1a:7f:61:1e:62:fe:
    a6:de:f2:61:dc:0b:2a:83:c5:f7:8c:70:ca:5c:87:
    37:0e:ee:27:ec:17:4a:2c:3f:b1:d3:a4:9f:95:76:
    73:6e:66:7a:e3:93:e2:59:4f:c3:8d:17:f3:0d:da:
    7c:05:fa:1f:f6:42:5b:8f:63:d1:48:05:c4:5b:03:
    17:e5:6f:94:2a:30:8e:93:45:da:39:dc:22:b4:25:
    f2:76:b3:34:bf:92:1e:07:14:a3:25:89:1a:46:11:
    9b:62:1a:6c:a8:80:e0:76:f4:40:d1:b3:7e:7c:23:
    42:53:0c:76:94:13:be:4f:80:7e:84:db:8a:a6:d5:
    20:6f:0c:e5:e3:ee:32:8a:5e:82:e7:53:12:e4:24:
    35:77:3a:dc:d6:f0:64:75:56:4a:03:a1:c3:09:fc:
    93:e9:bd:d5:2f:84:51:ce:5c:da:ee:6e:33:a1:72:
    16:6f:ad:17:f9:10:86:0d:d7:d9:38:90:6e:f9:19:
    3d:21:cb:82:3f:9d:e1:29:9d:0a:43:59:00:4f:8b:
    ad:52:e5:30:fd:cd:4e:51:dd:61:94:19:75:80:04:
    e0:1a:a2:7f:34:a3:10:55:90:0b:9f:11:dd:80:9e:
    ac:bc:4f:eb:84:54:bb:13:4d:dd:22:1a:06:f0:41:
    f0:87
publicExponent: 65537 (0x10001)
privateExponent:
    69:67:7c:ed:4e:ba:38:b6:11:da:7b:0a:ee:aa:8f:
    f8:42:61:40:ee:2b:17:f2:fa:6e:ab:a2:e1:00:cf:
    6e:67:b4:d5:58:00:62:df:07:5f:13:dc:0b:79:f7:
    81:65:73:72:ca:19:e3:3d:92:ed:17:ef:82:66:ce:
    cb:7c:73:9f:11:18:8f:3a:d7:4f:5c:76:2d:4c:32:
    25:de:9e:37:18:bb:b8:ed:d8:91:df:44:4e:45:5f:
    cc:34:2a:44:52:98:ca:7d:90:8d:8e:76:cf:28:68:
    8d:c6:dd:09:81:c9:b6:29:07:9d:ae:f6:03:62:a3:
    48:a7:0e:8b:64:19:31:82:ea:f2:68:00:02:78:03:
    28:6f:6f:58:c5:16:15:3e:e8:2c:54:1d:13:95:6d:
    f6:18:56:2d:a2:fe:29:d9:fc:fd:bd:38:88:27:11:
    a1:fb:7c:9c:8a:85:dc:8c:14:8d:91:6a:5d:5f:76:
    a9:c5:9a:70:4d:06:80:31:e5:35:c9:18:8c:d3:25:
    f5:56:98:34:e6:85:7e:f6:2e:a0:ac:0f:e2:dd:c8:
    a9:29:74:f9:cf:40:1b:80:c1:63:26:d8:6c:b6:92:
    fb:0b:d1:a6:81:56:a4:b7:83:b5:29:e7:92:c5:d5:
    45:63:7d:3e:1a:63:84:70:34:ac:21:e9:a6:b5:44:
    01
prime1:
    00:d8:66:d0:83:2f:15:06:d4:e3:b9:55:c4:9f:97:
    8d:2c:62:be:59:33:91:a7:75:c3:3b:66:97:47:a6:
    87:c1:1f:11:11:b7:b0:0b:53:48:14:14:74:4f:46:
    d6:78:dc:de:2a:25:13:a3:04:29:a2:07:27:02:84:
    08:e1:34:24:58:3d:3a:94:90:cd:5a:d8:87:b3:b2:
    c0:5e:84:6c:b6:c3:a4:5f:b0:8c:6e:89:df:79:28:
    2e:56:f5:1f:53:0d:90:ab:87:e1:c3:30:31:1c:6b:
    bb:05:28:b8:08:64:28:3c:76:9b:5d:6f:ea:f5:9a:
    0b:98:ca:ea:28:68:99:6e:87
prime2:
    00:c6:e7:1c:6e:02:17:2f:c3:54:dc:5f:ad:32:c0:
    a3:c1:75:74:e1:eb:3a:52:11:0e:2c:fc:f7:c7:91:
    a6:12:5b:35:43:84:49:51:d7:8c:50:21:ad:d3:64:
    3d:3e:3f:b5:a2:9e:ab:ed:3b:f8:2d:9f:5e:0f:34:
    57:81:7f:ec:b6:82:5f:42:d7:af:a3:de:a7:99:9e:
    64:b3:ba:85:06:20:b0:64:7d:60:a7:43:f1:5c:23:
    d3:d6:0c:ff:02:84:1b:37:62:c3:58:dc:97:81:89:
    80:08:2f:1e:e6:c5:94:dd:3b:6c:f8:32:29:85:13:
    d8:56:eb:54:cb:a0:a1:ee:01
exponent1:
    76:56:eb:4a:01:f2:4e:b5:16:ff:60:2e:d1:53:70:
    49:48:8a:6d:7f:6c:f4:95:ca:b8:ee:26:66:71:64:
    25:b1:16:85:88:dd:05:a4:7a:73:38:a8:4e:3e:1f:
    c5:22:8b:7f:a2:9c:f5:75:ae:4a:c3:fc:8a:3c:a8:
    1a:77:88:34:94:ef:37:15:64:a7:7c:67:e1:56:2c:
    2a:c3:e2:2b:a4:1b:7c:94:b0:87:36:70:75:f2:0a:
    3d:55:78:d6:d3:41:3c:fc:66:f2:75:a5:35:b4:98:
    26:7f:18:fc:c5:c0:d7:27:c9:58:b4:7e:59:e6:ee:
    d6:94:88:ae:a6:5c:d9:7b
exponent2:
    50:9b:d9:29:bc:2f:29:6c:40:38:0f:8e:61:c3:30:
    9a:76:bf:a7:cf:6d:13:55:56:29:65:5c:05:c5:41:
    48:af:2e:26:ee:b5:c8:35:52:e8:26:be:0b:ad:d4:
    24:26:2d:b6:7a:17:b3:4d:5a:87:22:cf:3b:da:3a:
    9c:80:fb:ad:fb:a8:1f:ae:c9:bf:df:bc:8c:c5:64:
    8a:72:4c:f6:ee:c8:8d:f1:41:fa:87:ce:89:48:fb:
    d1:03:f3:55:51:b4:b5:fd:90:ad:b2:b8:b4:06:c5:
    9c:8b:7c:3a:8a:58:8a:50:4b:19:4b:3b:08:73:c2:
    79:77:66:26:20:33:80:01
coefficient:
    0e:29:d0:12:89:0d:4f:e7:36:65:b6:1e:12:f3:d9:
    c9:fc:54:d8:6b:01:86:6b:8b:9e:65:e6:b2:c6:36:
    e1:67:d0:4b:4f:61:20:e5:82:e4:58:e3:91:91:a4:
    c5:cd:5c:bb:eb:20:3f:db:99:4f:39:e6:bb:fd:d8:
    83:04:a0:9c:bc:d8:f3:fb:5f:88:8a:4b:00:e9:78:
    23:3e:a0:5f:8f:7a:8c:10:df:62:af:83:1c:a8:5e:
    0f:ee:23:91:eb:e9:8a:62:89:b0:04:f1:df:c9:c5:
    d5:a2:49:50:aa:04:78:d8:c9:a5:22:8c:75:a8:2e:
    1e:78:4f:f4:35:b5:f1:79
#+end_example

